if __name__ == '__main__':
    print("**********MENU**********")

    credit = int(input("Введите данные по кредиту за месяц!"))
    insurance = int(input("Введите сумму за страховку"))
    fuel = int(input("Введите среднее количество литров, которое потребляет Ваша машина за месяц."))
    car_oil = int(input("Введите среднее количество масла, за месяц."))
    wheel = int(input("Введите цену за покрышки."))


    cr = credit * 12
    ins = insurance * 1
    fu = (fuel* 1.5) * 12
    co = (car_oil * 1) * 12
    wh = wheel
    year = (cr+ins+fu+co+wh)

    print("Вы должны платить:")
    print("За кредит за машину", cr, "$ в год")
    print("За страховку", ins, "$ в год")
    print("За топливо", fu, "$ в год")
    print("За моторное масло",co , "$ в год")
    print("За покрышки",wh , "$ в год")
    print("____________________________")
    print("Суммарно, ", year, "$ в год")


